/* 24. (**) Визначити, чи є задане число досконалим (якщо воно дорівнює сумі своїх дільників).
Наприклад, 6 - досконале число, бо 6 = 1 + 2 + 3. */

/**
 * @mainpage
 *
 * Основи документування. Лабораторна робота №8.1. Вступ до документації коду
 *
 * @author Ptashnik Maxim
 * @date 23-dec-2021
 * @version 1.0
 *
 */
 
/**
 * @file main.c
 * @brief Файл з реалізацію функціоналу програми лабораторної роботи
**/

#include <stdlib.h>
#include <time.h> 
/**
 * Return 1 - якщо число досконале, 0 - якщо ні.
 *
 * Функція перевіряє число на досконалість
 * @param  x число, яке будемо перевіряти
 * @return 1 - якщо число досконале, 0 - якщо ні.
 */
// Функція знаходження досконалого числа х.
int get_perfect_number( int x){
  int sum = 0;      
 //Знаходимо дільники.
 for(int i = 1; i < x; i++) {            
         if ( x % i == 0){
                sum += i;
         }
        }

        // якщо сума дільників дорівнює числу х, то число х - досконале.
         if ( x == sum){                        
          return 1;
         }

        // в іншому випадку, число не є досконалим.
         else {                                
          return 0; 
         }
        


}

/**
 * Головна функція.
 *
 * Послідовність дій:
 * - Перевіка чи є якісь аргументи з командної строки, якщо є, то запис в {@link x}, else заповнення випадковими числами
 * - Виклик функції {@get_perfect_number} та запис в змінну передаваючи в функцію {@link x}
 * @return успішний код повернення з програми (0)
 */

int main(int argc, char** argv) {

        int x;
        int result;

        //Якщо значення не передалось.
        if (argc == 1){
            srand (time(NULL));
            x = (int)random() % 100;
            result = get_perfect_number(x);

        } else {
            result = get_perfect_number((int)strtod(argv[1], 0));
        }

        return 0;    
}


